
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 9, 9, 1)]         0         
_________________________________________________________________
conv2d (Conv2D)              (None, 9, 9, 64)          640       
_________________________________________________________________
batch_normalization (BatchNo (None, 9, 9, 64)          256       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 9, 9, 64)          36928     
_________________________________________________________________
batch_normalization_1 (Batch (None, 9, 9, 64)          256       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 9, 9, 128)         73856     
_________________________________________________________________
batch_normalization_2 (Batch (None, 9, 9, 128)         512       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 9, 9, 128)         147584    
_________________________________________________________________
batch_normalization_3 (Batch (None, 9, 9, 128)         512       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 9, 9, 256)         295168    
_________________________________________________________________
batch_normalization_4 (Batch (None, 9, 9, 256)         1024      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 9, 9, 256)         590080    
_________________________________________________________________
batch_normalization_5 (Batch (None, 9, 9, 256)         1024      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 9, 9, 512)         1180160   
_________________________________________________________________
batch_normalization_6 (Batch (None, 9, 9, 512)         2048      
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 9, 9, 512)         2359808   
_________________________________________________________________
batch_normalization_7 (Batch (None, 9, 9, 512)         2048      
_________________________________________________________________
flatten (Flatten)            (None, 41472)             0         
_________________________________________________________________
dense (Dense)                (None, 729)               30233817  
_________________________________________________________________
reshape (Reshape)            (None, 81, 9)             0         
_________________________________________________________________
activation (Activation)      (None, 81, 9)             0         
=================================================================
Total params: 34,925,721
Trainable params: 34,921,881
Non-trainable params: 3,840

